backend/artillery.yml

config:
  target: "https://jungtongbam.onrender.com"
  phases:
    # Phase 1: Wake up the server and establish a baseline.
    # Send 5 virtual users per second for 30 seconds.
    - duration: 30
      arrivalRate: 5
      name: "Wake up and warm up"
    # Phase 2: Ramp up to a significant load.
    # Go from 5 to 100 virtual users arriving per second over 2 minutes.
    - duration: 120
      arrivalRate: 5
      rampTo: 100
      name: "Ramp up to 100 VUs/sec"
scenarios:
  - name: "Submit a unique score"
    flow:
      - post:
          url: "/api/game/score"
          json:
            # Using random values to prevent the 'already played' error
            gameType: "load_test_{{ $randomString(10) }}"
            round: "{{ $randomInt(1, 100) }}"
            score: "{{ $randomInt(1, 100000) }}"